### Solution (1)

#### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [3]:
# read csv
df = pd.read_csv("services.csv")

In [5]:
# head
df.head()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN

In [6]:
# tail
df.tail()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
18,19,19,NaN,NaN,NaN,Call for screening appointment (650-347-3648).,NaN,Provides free medical and dental care to those...,Low-income person without access to health care,NaN,...,NaN,"HEALTH SERVICES, Outpatient Care, Community Cl...",NaN,San Mateo Free Medical Clinic,NaN,"Belmont, Burlingame",active,Varies.,NaN,NaN
19,20,20,NaN,NaN,NaN,Walk in.,NaN,no unrequired fields for this service,NaN,NaN,...,NaN,NaN,NaN,Service with blank fields,NaN,NaN,defunct,NaN,NaN,NaN
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [7]:
# describe
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [9]:
# information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 22 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       23 non-null     int64
 1   location_id              23 non-null     int64
 2   program_id               0 non-null      float64
 3   accepted_payments        1 non-null      object
 4   alternate_name           1 non-null      object
 5   application_process      23 non-null     object
 6   audience                 14 non-null     object
 7   description              23 non-null     object
 8   eligibility              21 non-null     object
 9   email                    1 non-null      object
 10  fees                     21 non-null     object
 11  funding_sources          21 non-null     object
 12  interpretation_services  1 non-null      object
 13  keywords                 21 non-null     object
 14  languages                1 non-null      object
 15  name                     23 non-null     object
 16  required_documents       1 non-null      object
 17  service_areas            21 non-null     object
 18  status                   23 non-null     object
 19  wait_time                19 non-null     object
 20  website                  2 non-null      object
 21  taxonomy_ids             1 non-null      object
dtypes: float64(1), int64(2), object(19)
memory usage: 4.1+ KB

### Solution (2)

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [121]:
data = {
    'A' : 1,
    'B' : 2,
    'C' : 3
}

In [122]:
df = pd.DataFrame(data,index=[0,1,2])
# partial done

In [123]:
df

   A  B  C
0  1  2  3
1  1  2  3
2  1  2  3

### Solution (3)

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [104]:
data = {
    'values' : [10, 20, 30, 40, 50]
}

In [105]:
df = pd.DataFrame(data)

In [106]:
sum = df.loc[0:2].sum()

In [107]:
sum

values    60
dtype: int64

### Solution (4)

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column'Word_Count' that contains the number of words in each row of the 'Text' column.

In [115]:
data = {
    'Text': ['one fruits we eat','two mango are not good','three eggs got burst','four','five','six ball more for wicket','seven people are there to play a match','eight','nine','ten']
}

In [116]:
df = pd.DataFrame(data)

In [117]:
df

                                     Text
0                       one fruits we eat
1                  two mango are not good
2                    three eggs got burst
3                                    four
4                                    five
5                six ball more for wicket
6  seven people are there to play a match
7                                   eight
8                                    nine
9                                     ten

In [118]:
df['Word_Count'] = df['Text'].str.split().str.len()

In [119]:
df

                                     Text  Word_Count
0                       one fruits we eat           4
1                  two mango are not good           5
2                    three eggs got burst           4
3                                    four           1
4                                    five           1
5                six ball more for wicket           5
6  seven people are there to play a match           8
7                                   eight           1
8                                    nine           1
9                                     ten           1

### Solution (5)

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

##### DataFrame.size():
Return the size of Dataframe or series which is equivalent to total number of elements. That is rows x columns.

##### DataFrame.shape()
Return tuple of shape(Rows and Columns) of dataframes and series

In [125]:
df.size

9

In [126]:
df.shape

(3, 3)

### Solution (6)

#### Q.6 Which function of pandas do we use to read an excel file?

 pd.read_excel() is used to read data from excel file

### Solution (7)

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

#### The username is the part of the email address that appears before the '@' symbol. For example, if theemail address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username'column.

In [156]:
data = {
    'Email':['john.doe@example.com','james.clu@example.com','Ames.pear@example.com']
}

In [157]:
df = pd.DataFrame(data)

In [158]:
df

                   Email
0   john.doe@example.com
1  james.clu@example.com
2  Ames.pear@example.com

In [175]:
df['Username'] = df['Email'].str.split('@').str[0]

In [176]:
df

                   Email   Username
0   john.doe@example.com   john.doe
1  james.clu@example.com  james.clu
2  Ames.pear@example.com  Ames.pear

### Solution (8)

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
####    A B C
####    0 3 5 1
####    1 8 2 7
####    2 6 9 4
####    3 2 3 5
####    4 9 1 2

In [177]:
data = {
    'A': [3,8,6,2,9],
    'B': [5,2,9,3,1],
    'C': [1,7,4,5,2]
    }

In [178]:
df = pd.DataFrame(data)

In [179]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [196]:
new_df = df[['A','B']]

In [198]:
new_df[(new_df['A'] > 5 ) & (new_df['B'] < 10)]

   A  B
1  8  2
2  6  9
4  9  1

### Solution (9)

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [2]:
import pandas as pd

In [7]:
data = {
    'Values':[1,2,3,4,5,6,6,7,8,4,34]
}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

    Values
0        1
1        2
2        3
3        4
4        5
5        6
6        6
7        7
8        8
9        4
10      34

In [12]:
mean = df.mean()

In [13]:
mean

Values    7.272727
dtype: float64

In [14]:
median = df.median()

In [15]:
median

Values    5.0
dtype: float64

In [16]:
std_dev = df.std()

In [17]:
std_dev

Values    9.111431
dtype: float64

### Solution (10)

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [18]:
data = {
    'Sales':[2000,4000,5000,45000,7000,40000,89000,7700,4032,2300],
    'Date':['21-02-23','22-02-23','22-02-23','23-02-23','24-02-23','25-02-23','26-02-23','27-02-23','28-02-23','1-03-23']
}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

   Sales      Date
0   2000  21-02-23
1   4000  22-02-23
2   5000  22-02-23
3  45000  23-02-23
4   7000  24-02-23
5  40000  25-02-23
6  89000  26-02-23
7   7700  27-02-23
8   4032  28-02-23
9   2300   1-03-23

In [30]:
df['MovingAverage'] = df['Sales'].mean()

In [42]:
import pandas as pd

def add_moving_average(df):
    # Sort the DataFrame by date
    df = df.sort_values('Date')
    
    # Compute the moving average using a rolling window of size 7
    ma = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    # Add the moving average as a new column to the DataFrame
    df['MovingAverage'] = ma
    
    return df

# Example usage
df = pd.DataFrame({'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05',
                            '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10'],
                   'Sales': [10, 20, 15, 25, 30, 20, 15, 10, 5, 10]})
df = add_moving_average(df)
print(df)

         Date  Sales  MovingAverage
0  2022-01-01     10      10.000000
1  2022-01-02     20      15.000000
2  2022-01-03     15      15.000000
3  2022-01-04     25      17.500000
4  2022-01-05     30      20.000000
5  2022-01-06     20      20.000000
6  2022-01-07     15      19.285714
7  2022-01-08     10      19.285714
8  2022-01-09      5      17.142857
9  2022-01-10     10      16.428571

### Solution (11)

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [53]:
import datetime
data = {
    'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
}

In [54]:
df = pd.DataFrame(data)

In [55]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [62]:
df['Weekday'] = pd.to_datetime(df['Date']).dt.day_name()

In [63]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday